/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   is_quote.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: teando <teando@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/04/18 23:58:06 by teando            #+#    #+#             */
/*   Updated: 2025/04/18 23:59:04 by teando           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/**
 * @brief 文字列にクォートが含まれているかチェックする
 *
 * @param s チェックする文字列
 * @return int クォートが含まれていれば1、なければ0
 */
int	is_quoted(const char *s)
{
	while (*s)
	{
		if (*s == '\'' || *s == '"')
			return (1);
		else
			++s;
	}
	return (0);
}
